# encoding: utf-8
require 'minitest/autorun'

require 'jp'

class JpTest < MiniTest::Test
  def setup
    @text = "まではタイムラインは『タップしてツイートを読み込む』って出て来て見ることが出来たのに、、、\n今は出てこないで時間空けてTL見ると、すべて見れないんですけど💢早く元通りにしてください！"
  end

  def test_parse
    expected = ["まで", "は", "タイム", "ライン", "は", "『", "タップ", "し", "て", "ツイート", "を", "読み込む", "』", "って", "出", "て", "来", "て", "見る", "こと", "が", "出来", "た", "のに", "、", "、", "、", "今", "は", "出", "て", "こ", "ない", "で", "時間", "空け", "て", "TL", "見る", "と", "、", "すべて", "見れ", "ない", "ん", "です", "けど", "💢", "早く", "元通り", "に", "し", "て", "ください", "！"]
    assert_equal Jp.parse(@text), expected
  end
end
